Examinator/src/Documents/РассылкаСообщенийСУО/РассылкаСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РассылкаСообщенийСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <basedOn>Catalog.УчебныеГруппыСУО</basedOn>
  <basedOn>Document.ПроведениеОбученияСУО</basedOn>
  <basedOn>Document.ПроведениеПрограммыОбученияСУО</basedOn>
  <basedOn>Catalog.СерииПинКодовСУО</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.СерииПинКодовСУО</types>
      <types>DocumentRef.ВосстановлениеПароляСУ</types>
      <types>CatalogRef.ОтборыПользователейСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеАвтоматическойРассылки</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.НовостьСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторуАвтоматическойРассылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподавателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организаторам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьФайлыОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>DocumentRef.СообщениеСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправленоНаЭлектроннуюПочту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправкаНаЭлектроннуюПочтуЗапрещена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПопытокОтправкиНаЭлектроннуюПочту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/АвтоматическиеРассылкиСУО/АвтоматическиеРассылкиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоматическиеРассылкиСУО</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияАдминистратору</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияПреподавателям</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщенияОрганизаторам</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АльтернативныйШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АльтернативнаяЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.ОрганизаторыСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборПользователей</name>
    <type>
      <types>CatalogRef.ОтборыПользователейСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/РассылкаСообщенийСУО/Forms/РассылкиПроведенияОбучения/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	СформироватьТаблицуАвтоматическихРассылок();
	
	СформироватьКомандыСоздания();

	Если ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		Сообщения.Параметры.УстановитьЗначениеПараметра("ПроведениеОбучения", Параметры.ПроведениеОбучения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПроведениеПрограммыОбучения) Тогда
		Сообщения.Параметры.УстановитьЗначениеПараметра("ПроведениеПрограммыОбучения", Параметры.ПроведениеПрограммыОбучения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьКомандСоздания();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАвтоматическиеПравила

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ АвтоматическиеПравила

&НаКлиенте
Процедура АвтоматическиеПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияПодчиненногоОкна", ЭтотОбъект);
	Если Поле.Имя = Элементы.АвтоматическиеПравилаШаблон.Имя Тогда
		ПоказатьЗначение(ОписаниеОповещения, Элемент.ТекущиеДанные.Шаблон);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.КлючЗаписи);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Элемент.ТекущиеДанные.ТолькоПросмотр);
		ПараметрыФормы.Вставить("ТолькоПросмотрУсловийПрименения", Истина);
		ОткрытьФорму("РегистрСведений.АвтоматическиеРассылкиСУО.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПодчиненногоОкна(ЗначениеЗакрытия, ДополнительныеПараметры) Экспорт
	СформироватьТаблицуАвтоматическихРассылок();
	УстановитьДоступностьКомандСоздания();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СформироватьТаблицуАвтоматическихРассылок()
	
	АвтоматическиеПравила.Очистить();
	
	// Формируем массив организаторов
	
	Организаторы = Новый Массив;
		
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(Параметры.ПроведениеОбучения, Организаторы);
	Справочники.ОрганизаторыСУО.ОрганизаторыЭлемента(Параметры.ПроведениеПрограммыОбучения, Организаторы);
	
	Если Организаторы.Найти(Справочники.ОрганизаторыСУО.ПустаяСсылка()) = Неопределено Тогда		
		Организаторы.Добавить(Справочники.ОрганизаторыСУО.ПустаяСсылка()); // Чтобы искать правила без организатора
	КонецЕсли;	
	
	// Формируем массив отборов
	
	ОтборыПользователей = Справочники.ОтборыПользователейСУО.ВсеОтборы();
	Если ОтборыПользователей.Найти(Справочники.ОтборыПользователейСУО.ПустаяСсылка()) = Неопределено Тогда
		ОтборыПользователей.Добавить(Справочники.ОтборыПользователейСУО.ПустаяСсылка()); // Для поиска без отбора
	КонецЕсли;	
	
	// Рассылки проведений обучения
	
	Если ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		
		МассивТипов = Новый Массив;
		Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПроведенийОбучения(МассивТипов);
		
		СценарийОбучения = Документы.ПроведениеОбученияСУО.СценарийОбучения(Параметры.ПроведениеОбучения);
		ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(Параметры.ПроведениеОбучения, СценарийОбучения);
		Мероприятие = ?(ТипЗнч(СценарийОбучения) = Тип("СправочникСсылка.КаталогМероприятийСУО"), СценарийОбучения, Неопределено);
		
		Для каждого ТипРассылки Из МассивТипов Цикл
			
			ДанныеРассылки = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(
				ТипРассылки, ВидОбучения, Мероприятие,, Параметры.ПроведениеОбучения, Организаторы, ОтборыПользователей);  	
			
			Если ДанныеРассылки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = АвтоматическиеПравила.Добавить();
			НоваяСтрока.Тип = ТипРассылки;
			НоваяСтрока.Шаблон = ДанныеРассылки.Шаблон;
			НоваяСтрока.ТолькоЭлектроннаяПочта = ДанныеРассылки.ТолькоЭлектроннаяПочта;
			НоваяСтрока.КлючЗаписи = ДанныеРассылки.КлючЗаписи;
			НоваяСтрока.ИмяТипа = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипРассылки); 
			
			Если ЗначениеЗаполнено(ДанныеРассылки.КлючЗаписи.ПроведениеОбучения) Тогда
				НоваяСтрока.Действует = НСтр("ru = 'Только на это обучение'");
				НоваяСтрока.ТолькоПросмотр = Ложь;				
				НоваяСтрока.ДоступноСоздание = Ложь;
			ИначеЕсли ЗначениеЗаполнено(ДанныеРассылки.КлючЗаписи.Мероприятие) Тогда
				НоваяСтрока.Действует = НСтр("ru = 'На все обучения этого шаблона'");
				НоваяСтрока.ТолькоПросмотр = Истина;
				НоваяСтрока.ДоступноСоздание = Истина;
			ИначеЕсли ЗначениеЗаполнено(ДанныеРассылки.КлючЗаписи.ВидМероприятия) Тогда
				НоваяСтрока.Действует = НСтр("ru = 'На все обучения данного вида'");
				НоваяСтрока.ТолькоПросмотр = Истина;
				НоваяСтрока.ДоступноСоздание = Истина;
			Иначе
				НоваяСтрока.Действует = НСтр("ru = 'На все обучения'");				
				НоваяСтрока.ТолькоПросмотр = Истина;
				НоваяСтрока.ДоступноСоздание = Истина;
			КонецЕсли;			
						
		КонецЦикла;
		
	КонецЕсли;
	
	// Рассылки программ обучения
	
	Если ЗначениеЗаполнено(Параметры.ПроведениеПрограммыОбучения) Тогда
		
		МассивТипов = Новый Массив;
		Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПрограммОбучения(МассивТипов);
		
		ПрограммаОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПрограммаОбучения(Параметры.ПроведениеПрограммыОбучения);
		
		Для каждого ТипРассылки Из МассивТипов Цикл
			
			ДанныеРассылки = РегистрыСведений.АвтоматическиеРассылкиСУО.АвтоматическаяРассылка(
				ТипРассылки,,,ПрограммаОбучения, Параметры.ПроведениеПрограммыОбучения, Организаторы, ОтборыПользователей,,Параметры.ПроведениеПрограммыОбучения);
								
			Если ДанныеРассылки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = АвтоматическиеПравила.Добавить();
			НоваяСтрока.Тип = ТипРассылки;
			НоваяСтрока.Шаблон = ДанныеРассылки.Шаблон;
			НоваяСтрока.ТолькоЭлектроннаяПочта = ДанныеРассылки.ТолькоЭлектроннаяПочта;
			НоваяСтрока.КлючЗаписи = ДанныеРассылки.КлючЗаписи;
			НоваяСтрока.ИмяТипа = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипРассылки); 

			Если ЗначениеЗаполнено(ДанныеРассылки.КлючЗаписи.ПроведениеПрограммыОбучения) Тогда
				НоваяСтрока.Действует = НСтр("ru = 'Только на эту программу обучения'");
				НоваяСтрока.ТолькоПросмотр = Ложь;
				НоваяСтрока.ДоступноСоздание = Ложь;
			ИначеЕсли ЗначениеЗаполнено(ДанныеРассылки.КлючЗаписи.ПрограммаОбучения) Тогда
				НоваяСтрока.Действует = НСтр("ru = 'На все программы обучения этого шаблона'");
				НоваяСтрока.ТолькоПросмотр = Истина;
				НоваяСтрока.ДоступноСоздание = Истина;
			Иначе
				НоваяСтрока.Действует = НСтр("ru = 'На все программы обучения'");
				НоваяСтрока.ТолькоПросмотр = Истина;
				НоваяСтрока.ДоступноСоздание = Истина;
			КонецЕсли;			
			
		КонецЦикла;		
		
	КонецЕсли;	
	
	// Получаем рассылки отборов
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКомандыСоздания()	
	
	МассивТипов = Новый Массив;
	
	Если ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПроведенийОбучения(МассивТипов);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ПроведениеПрограммыОбучения) Тогда
		Перечисления.ТипыАвтоматическихРассылокСУО.ДобавитьТипыПрограммОбучения(МассивТипов);
	КонецЕсли;
	
	СписокВыбора = Перечисления.ТипыАвтоматическихРассылокСУО.СписокВыбора();
	Если СписокВыбора <> Неопределено Тогда
		МассивВычитания = Новый Массив;
		Для каждого ТипРассылки Из МассивТипов Цикл
			Если СписокВыбора.НайтиПоЗначению(ТипРассылки) = Неопределено Тогда
				МассивВычитания.Добавить(ТипРассылки);
			КонецЕсли;
		КонецЦикла;
		МассивТипов = ОбщегоНазначенияКлиентСервер.СократитьМассив(МассивТипов, МассивВычитания);
	КонецЕсли;
	
	// Формируем команды создания
	
	Для каждого ТипРассылки Из МассивТипов Цикл
		
		ИмяПеречисления = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипРассылки);
		ИмяЭлемента = "Создать_" + ИмяПеречисления;
		
		Команда = Команды.Добавить(ИмяЭлемента);
		Команда.Действие  = "Подключаемый_СоздатьАвтоматическуюРассылкуПоТипу";
		Команда.Заголовок = Строка(ТипРассылки);

		ЭлементФормы = Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Элементы.АвтоматическиеПравилаКомандыСоздания); 	
		ЭлементФормы.ИмяКоманды = ИмяЭлемента;			
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандСоздания()
	
	Для каждого Строка Из АвтоматическиеПравила Цикл
		ИмяЭлемента = "Создать_" + Строка.ИмяТипа;
		Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
			Элементы[ИмяЭлемента].Доступность = Строка.ДоступноСоздание;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьАвтоматическуюРассылкуПоТипу(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипа = СтрЗаменить(Команда.Имя, "Создать_", "");
	ТипРассылки = ПредопределенноеЗначение("Перечисление.ТипыАвтоматическихРассылокСУО." + ИмяТипа);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияПодчиненногоОкна", ЭтотОбъект);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Тип", ТипРассылки);
	Если ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		ЗначенияЗаполнения.Вставить("ПроведениеОбучения", Параметры.ПроведениеОбучения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ПроведениеПрограммыОбучения) Тогда
		ЗначенияЗаполнения.Вставить("ПроведениеПрограммыОбучения", Параметры.ПроведениеПрограммыОбучения);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ТолькоПросмотрУсловийПрименения", Истина);
	ОткрытьФорму("РегистрСведений.АвтоматическиеРассылкиСУО.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);	
	
КонецПроцедуры


#КонецОбласти
